//splice slice
//.splice(ตำแหน่งที่จะลบ,จำนวนที่จะลบ,สมาชิกที่ต้องการแทรกเข้าไปในตำแหน่งที่ลบ)
//.slice(ตำแหน่งที่เริ่มต้น,ตำแหน่งสุดท้าย-1)

const data = [10,20,30,40,50]
console.log(data)

//ลบ
//******.splice(ตำแหน่งที่จะลบ,จำนวนที่จะลบ,สมาชิกที่ต้องการแทรกเข้าไปในตำแหน่งที่ลบ)
//จะลบ 20,30,40
// data.splice(1,3,999)
// console.log(data)

//เรียกข้อมูลมาใช้งาน
//******.slice(ตำแหน่งที่เริ่มต้น,ตำแหน่งสุดท้าย-1)
//ต้องการ 20,30
//ไม่กระทบกับ array เดิม ต้องมีตัวแปรมารับ
const lastData = data.slice(1,3) //index 1-2 [20,30]
console.log(lastData)

